# vsoWidgetSetType

## Description
Changes a type of a widget that was already added.

```pascal
PROCEDURE vsoWidgetSetType(
				widgetID   : LONGINT;
				widgetType : LONGINT);
```

```python

def vs.vsoWidgetSetType(widgetID, widgetType):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|widgetID|LONGINT||
|widgetType|LONGINT||

## Version
Availability: from Vectorworks 2020
## Category
* Object Events